index.org
#+TITLE: Projet Windows Server 2017
#+AUTHOR: Guillaume Quittet
#+DATE: Du 23 octobre 2017 au 27 octobre 2017
#+LANGUAGE: fr
#+OPTIONS: timestamp:nil

* Tâches [2/5]
- [X] Tous les groupes vont devoir installer la version 2012 R2 de Windows Server.
- [X] Des étudiants vont devoir créer et configurer le réseau (BackBone).
- [-] Réalisation d'un adressage IP correct et évolutif. [1/2]
  - [X] IPv4
  - [ ] IPv6
- [-] 4 étudiants vont devoir configurer le DCRoot (ADDS, DNS, Sites et Services, etc) [2/3]
  - [X] Installation ADDS
  - [X] Configuration des sites et services
  - [ ] Configuration du DNS
- [-] Chaque LAN va devoir créer un DNS primaire et un DHCP. [1/3]
  - [X] Chaque groupe va devoir posséder un ADDS.
  - [-] Dans un LAN, le groupe impair va devoir créer et configurer un DNS primaire. [1/2]
    - [X] Installation du DNS
    - [ ] Configuration du DNS
  - [-] Dans un LAN, le groupe pair va devoir créer et configurer le DHCP. [1/2]
    - [X] Installation du DHCP
    - [ ] Configuration du DHCP
* Groupes
| Numéro | LAN  | Pays       |
|--------+------+------------|
| <c>    | <c>  | <c>        |
| 1      | LAN1 | Belgique   |
| 2      | LAN1 | Pays-Bas   |
| 3      | LAN2 | Espagne    |
| 4      | LAN2 | Portugal   |
| 5      | LAN3 | Allemagne  |
| 6      | LAN3 | Autriche   |
| 7      | LAN4 | France     |
| 8      | LAN4 | Italie     |
| 9      | LAN5 | Angleterre |
| 10     | LAN5 | Irlande    |

* Adressage IP
Par LAN, il y a 1024 adresses. La dernière adresse disponible est l'adresse de passerelle.\\
Le masque de sous-réseaux pour toutes les adresses IPv4 est : */22* ou *255.255.252.0*.\\
Le préfix de toutes les adresses IPv6 est : */64*.
** LAN1
*** IPv4
De *192.168.0.1* à *192.168.3.254*
| Groupe | Adresse IP  |
| <c>    | <c>         |
|--------+-------------|
| G1     | 192.168.0.2 |
| G2     | 192.168.2.1 |
*** IPv6
| <c>    | <c>                   | <c>                   | <c>                   |
| Groupe | Première adresse      | Dernière adresse      | Passerelle par défaut |
|--------+-----------------------+-----------------------+-----------------------|
| G1     | FD00:DB8:CAFE:1::0001 | FD00:DB8:CAFE:1::0999 | FD00:DB8:CAFE:1::FFFF |
| G2     | FD00:DB8:CAFE:1::1001 | FD00:DB8:CAFE:1::1999 | FD00:DB8:CAFE:1::FFFF |

** LAN2
*** IPv4
De *192.168.4.1* à *192.168.7.254*
| Groupe | Adresse IP  |
| <c>    | <c>         |
|--------+-------------|
| G3     | 192.168.4.1 |
| G4     | 192.168.6.1 |
*** IPv6
| <c>    | <c>                   | <c>                   | <c>                   |
| Groupe | Première adresse      | Dernière adresse      | Passerelle par défaut |
|--------+-----------------------+-----------------------+-----------------------|
| G3     | FD00:DB8:CAFE:2::0001 | FD00:DB8:CAFE:2::0999 | FD00:DB8:CAFE:2::FFFF |
| G4     | FD00:DB8:CAFE:2::1001 | FD00:DB8:CAFE:2::1999 | FD00:DB8:CAFE:2::FFFF |

** LAN3
*** IPv4
De *192.168.8.1* à *192.168.11.254*
| Groupe | Adresse IP   |
| <c>    | <c>          |
|--------+--------------|
| G5     | 192.168.8.1  |
| G6     | 192.168.10.1 |

*** IPv6
| <c>    | <c>                   | <c>                   | <c>                   |
| Groupe | Première adresse      | Dernière adresse      | Passerelle par défaut |
|--------+-----------------------+-----------------------+-----------------------|
| G5     | FD00:DB8:CAFE:3::0001 | FD00:DB8:CAFE:3::0999 | FD00:DB8:CAFE:3::FFFF |
| G6     | FD00:DB8:CAFE:3::1001 | FD00:DB8:CAFE:3::1999 | FD00:DB8:CAFE:3::FFFF |

** LAN4
*** IPVv4
De *192.168.12.1* à *192.168.15.254*
| Groupe | Adresse IP   |
| <c>    | <c>          |
|--------+--------------|
| G7     | 192.168.12.1 |
| G8     | 192.168.14.1 |

