index.html
<!doctype html>
<html lang="fr">
<head>
<title>Projet Windows Server 2017</title>
<meta charset="utf-8">
<meta name="viewport" content="width=device-width, initial-scale=1">
<meta name="generator" content="Org-mode">
<meta name="author" content="Guillaume Quittet">

<link  href="https://cdnjs.cloudflare.com/ajax/libs/twitter-bootstrap/3.3.5/css/bootstrap.min.css" rel="stylesheet">
</head>
<body>
<div id="content" class="container">
<div class="row"><div class="col-md-9"><h1 class="title">Projet Windows Server 2017</h1>

<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> Tâches <code>[2/5]</code></h2>
<div class="outline-text-2" id="text-1">
<ul class="org-ul">
<li><code>[X]</code> Tous les groupes vont devoir installer la version 2012 R2 de Windows Server.
</li>
<li><code>[X]</code> Des étudiants vont devoir créer et configurer le réseau (BackBone).
</li>
<li><code>[-]</code> Réalisation d'un adressage IP correct et évolutif. <code>[1/2]</code>
<ul class="org-ul">
<li><code>[X]</code> IPv4
</li>
<li><code>[&#xa0;]</code> IPv6
</li>
</ul>
</li>
<li><code>[-]</code> 4 étudiants vont devoir configurer le DCRoot (ADDS, DNS, Sites et Services, etc) <code>[2/3]</code>
<ul class="org-ul">
<li><code>[X]</code> Installation ADDS
</li>
<li><code>[X]</code> Configuration des sites et services
</li>
<li><code>[&#xa0;]</code> Configuration du DNS
</li>
</ul>
</li>
<li><code>[-]</code> Chaque LAN va devoir créer un DNS primaire et un DHCP. <code>[1/3]</code>
<ul class="org-ul">
<li><code>[X]</code> Chaque groupe va devoir posséder un ADDS.
</li>
<li><code>[-]</code> Dans un LAN, le groupe impair va devoir créer et configurer un DNS primaire. <code>[1/2]</code>
<ul class="org-ul">
<li><code>[X]</code> Installation du DNS
</li>
<li><code>[&#xa0;]</code> Configuration du DNS
</li>
</ul>
</li>
<li><code>[-]</code> Dans un LAN, le groupe pair va devoir créer et configurer le DHCP. <code>[1/2]</code>
<ul class="org-ul">
<li><code>[X]</code> Installation du DHCP
</li>
<li><code>[&#xa0;]</code> Configuration du DHCP
</li>
</ul>
</li>
</ul>
</li>
</ul>
</div>
</div>
<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> Groupes</h2>
<div class="outline-text-2" id="text-2">
<table class="table table-striped table-bordered table-hover table-condensed">


<colgroup>
<col  class="center">

<col  class="center">

<col  class="center">
</colgroup>
<thead>
<tr>
<th scope="col" class="text-center">Numéro</th>
<th scope="col" class="text-center">LAN</th>
<th scope="col" class="text-center">Pays</th>
</tr>
</thead>
<tbody>
<tr>
<td class="text-center">1</td>
<td class="text-center">LAN1</td>
<td class="text-center">Belgique</td>
</tr>

<tr>
<td class="text-center">2</td>
<td class="text-center">LAN1</td>
<td class="text-center">Pays-Bas</td>
</tr>

<tr>
<td class="text-center">3</td>
<td class="text-center">LAN2</td>
<td class="text-center">Espagne</td>
</tr>

<tr>
<td class="text-center">4</td>
<td class="text-center">LAN2</td>
<td class="text-center">Portugal</td>
</tr>

<tr>
<td class="text-center">5</td>
<td class="text-center">LAN3</td>
<td class="text-center">Allemagne</td>
</tr>

<tr>
<td class="text-center">6</td>
<td class="text-center">LAN3</td>
<td class="text-center">Autriche</td>
</tr>

<tr>
<td class="text-center">7</td>
<td class="text-center">LAN4</td>
<td class="text-center">France</td>
</tr>

<tr>
<td class="text-center">8</td>
<td class="text-center">LAN4</td>
<td class="text-center">Italie</td>
</tr>

<tr>
<td class="text-center">9</td>
<td class="text-center">LAN5</td>
<td class="text-center">Angleterre</td>
</tr>

<tr>
<td class="text-center">10</td>
<td class="text-center">LAN5</td>
<td class="text-center">Irlande</td>
</tr>
</tbody>
</table>
</div>
</div>

<div id="outline-container-sec-3" class="outline-2">
<h2 id="sec-3"><span class="section-number-2">3</span> Adressage IP</h2>
<div class="outline-text-2" id="text-3">
<p>
Par LAN, il y a 1024 adresses. La dernière adresse disponible est l'adresse de passerelle.
Le masque de sous-réseaux pour toutes les adresses IPv4 est : <b>/22</b> ou <b>255.255.252.0</b>.
Le préfix de toutes les adresses IPv6 est : <b>/64</b>.
</p>
</div>
<div id="outline-container-sec-3-1" class="outline-3">
<h3 id="sec-3-1"><span class="section-number-3">3.1</span> LAN1</h3>
<div class="outline-text-3" id="text-3-1">
</div><div id="outline-container-sec-3-1-1" class="outline-4">
<h4 id="sec-3-1-1"><span class="section-number-4">3.1.1</span> IPv4</h4>
<div class="outline-text-4" id="text-3-1-1">
<p>
De <b>192.168.0.1</b> à <b>192.168.3.254</b>
</p>
<table class="table table-striped table-bordered table-hover table-condensed">


<colgroup>
<col  class="center">

<col  class="center">
</colgroup>
<thead>
<tr>
<th scope="col" class="text-center">Groupe</th>
<th scope="col" class="text-center">Adresse IP</th>
</tr>
</thead>
<tbody>
<tr>
<td class="text-center">G1</td>
<td class="text-center">192.168.0.1</td>
</tr>

<tr>
<td class="text-center">G2</td>
<td class="text-center">192.168.2.1</td>
</tr>
</tbody>
</table>
</div>
</div>
<div id="outline-container-sec-3-1-2" class="outline-4">
<h4 id="sec-3-1-2"><span class="section-number-4">3.1.2</span> IPv6</h4>
<div class="outline-text-4" id="text-3-1-2">
<table class="table table-striped table-bordered table-hover table-condensed">


<colgroup>
<col  class="center">

<col  class="center">

<col  class="center">

<col  class="center">
</colgroup>
<thead>
<tr>
<th scope="col" class="text-center">Groupe</th>
<th scope="col" class="text-center">Première adresse</th>
<th scope="col" class="text-center">Dernière adresse</th>
<th scope="col" class="text-center">Passerelle par défaut</th>
</tr>
</thead>
<tbody>
<tr>
<td class="text-center">G1</td>
<td class="text-center">FD00:DB8:CAFE:1::0001</td>
<td class="text-center">FD00:DB8:CAFE:1::0999</td>
<td class="text-center">FD00:DB8:CAFE:1::FFFF</td>
</tr>

<tr>
<td class="text-center">G2</td>
<td class="text-center">FD00:DB8:CAFE:1::1001</td>
<td class="text-center">FD00:DB8:CAFE:1::1999</td>
<td class="text-center">FD00:DB8:CAFE:1::FFFF</td>
</tr>
</tbody>
</table>
</div>
</div>
</div>

<div id="outline-container-sec-3-2" class="outline-3">
<h3 id="sec-3-2"><span class="section-number-3">3.2</span> LAN2</h3>
<div class="outline-text-3" id="text-3-2">
</div><div id="outline-container-sec-3-2-1" class="outline-4">
<h4 id="sec-3-2-1"><span class="section-number-4">3.2.1</span> IPv4</h4>
<div class="outline-text-4" id="text-3-2-1">
<p>
De <b>192.168.4.1</b> à <b>192.168.7.254</b>
</p>
<table class="table table-striped table-bordered table-hover table-condensed">


<colgroup>
<col  class="center">

<col  class="center">
</colgroup>
<thead>
<tr>
<th scope="col" class="text-center">Groupe</th>
<th scope="col" class="text-center">Adresse IP</th>
</tr>
</thead>
<tbody>
<tr>
<td class="text-center">G3</td>
<td class="text-center">192.168.4.1</td>
</tr>

<tr>
<td class="text-center">G4</td>
<td class="text-center">192.168.6.1</td>
</tr>
</tbody>
</table>
</div>
</div>
<div id="outline-container-sec-3-2-2" class="outline-4">
<h4 id="sec-3-2-2"><span class="section-number-4">3.2.2</span> IPv6</h4>
<div class="outline-text-4" id="text-3-2-2">
<table class="table table-striped table-bordered table-hover table-condensed">


<colgroup>
<col  class="center">

<col  class="center">

<col  class="center">

<col  class="center">
</colgroup>
<thead>
<tr>
<th scope="col" class="text-center">Groupe</th>
<th scope="col" class="text-center">Première adresse</th>
<th scope="col" class="text-center">Dernière adresse</th>
<th scope="col" class="text-center">Passerelle par défaut</th>
</tr>
</thead>
<tbody>
<tr>
<td class="text-center">G3</td>
<td class="text-center">FD00:DB8:CAFE:2::0001</td>
<td class="text-center">FD00:DB8:CAFE:2::0999</td>
<td class="text-center">FD00:DB8:CAFE:2::FFFF</td>
</tr>

<tr>
<td class="text-center">G4</td>
<td class="text-center">FD00:DB8:CAFE:2::1001</td>
<td class="text-center">FD00:DB8:CAFE:2::1999</td>
<td class="text-center">FD00:DB8:CAFE:2::FFFF</td>
</tr>
</tbody>
</table>
</div>
</div>
</div>

<div id="outline-container-sec-3-3" class="outline-3">
<h3 id="sec-3-3"><span class="section-number-3">3.3</span> LAN3</h3>
<div class="outline-text-3" id="text-3-3">
</div><div id="outline-container-sec-3-3-1" class="outline-4">
<h4 id="sec-3-3-1"><span class="section-number-4">3.3.1</span> IPv4</h4>
<div class="outline-text-4" id="text-3-3-1">
<p>
De <b>192.168.8.1</b> à <b>192.168.11.254</b>
</p>
<table class="table table-striped table-bordered table-hover table-condensed">


<colgroup>
<col  class="center">

<col  class="center">
</colgroup>
<thead>
<tr>
<th scope="col" class="text-center">Groupe</th>
<th scope="col" class="text-center">Adresse IP</th>
</tr>
</thead>
<tbody>
<tr>
<td class="text-center">G5</td>
<td class="text-center">192.168.8.1</td>
</tr>

<tr>
<td class="text-center">G6</td>
<td class="text-center">192.168.10.1</td>
</tr>
</tbody>
</table>
</div>
</div>

<div id="outline-container-sec-3-3-2" class="outline-4">
<h4 id="sec-3-3-2"><span class="section-number-4">3.3.2</span> IPv6</h4>
<div class="outline-text-4" id="text-3-3-2">
<table class="table table-striped table-bordered table-hover table-condensed">


<colgroup>
<col  class="center">

<col  class="center">

<col  class="center">

<col  class="center">
</colgroup>
<thead>
<tr>
<th scope="col" class="text-center">Groupe</th>
<th scope="col" class="text-center">Première adresse</th>
<th scope="col" class="text-center">Dernière adresse</th>
<th scope="col" class="text-center">Passerelle par défaut</th>
</tr>
</thead>
<tbody>
<tr>
<td class="text-center">G5</td>
<td class="text-center">FD00:DB8:CAFE:3::0001</td>
<td class="text-center">FD00:DB8:CAFE:3::0999</td>
<td class="text-center">FD00:DB8:CAFE:3::FFFF</td>
</tr>

<tr>
<td class="text-center">G6</td>
<td class="text-center">FD00:DB8:CAFE:3::1001</td>
<td class="text-center">FD00:DB8:CAFE:3::1999</td>
<td class="text-center">FD00:DB8:CAFE:3::FFFF</td>
</tr>
</tbody>
</table>
</div>
</div>
</div>

<div id="outline-container-sec-3-4" class="outline-3">
<h3 id="sec-3-4"><span class="section-number-3">3.4</span> LAN4</h3>
<div class="outline-text-3" id="text-3-4">
</div><div id="outline-container-sec-3-4-1" class="outline-4">
<h4 id="sec-3-4-1"><span class="section-number-4">3.4.1</span> IPVv4</h4>
<div class="outline-text-4" id="text-3-4-1">
<p>
De <b>192.168.12.1</b> à <b>192.168.15.254</b>
</p>
<table class="table table-striped table-bordered table-hover table-condensed">


<colgroup>
<col  class="center">

<col  class="center">
</colgroup>
<thead>
<tr>
<th scope="col" class="text-center">Groupe</th>
<th scope="col" class="text-center">Adresse IP</th>
</tr>
</thead>
<tbody>
<tr>
<td class="text-center">G7</td>
<td class="text-center">192.168.12.1</td>
</tr>

<tr>
<td class="text-center">G8</td>
<td class="text-center">192.168.14.1</td>
</tr>
</tbody>
</table>
</div>
</div>
