index.org
*** IPv6
| <c>    | <c>                   | <c>                   | <c>                   |
| Groupe | Première adresse      | Dernière adresse      | Passerelle par défaut |
|--------+-----------------------+-----------------------+-----------------------|
| G7     | FD00:DB8:CAFE:4::0001 | FD00:DB8:CAFE:4::0999 | FD00:DB8:CAFE:4::FFFF |
| G8     | FD00:DB8:CAFE:4::1001 | FD00:DB8:CAFE:4::1999 | FD00:DB8:CAFE:4::FFFF |

** LAN5
*** IPv4
De *192.168.16.1* à *192.168.19.254*
| Groupe | Adresse IP   |
| <c>    | <c>          |
|--------+--------------|
| G9     | 192.168.16.1 |
| G10    | 192.168.18.1 |

*** IPv6 
| <c>    | <c>                   | <c>                   | <c>                   |
| Groupe | Première adresse      | Dernière adresse      | Passerelle par défaut |
|--------+-----------------------+-----------------------+-----------------------|
| G9     | FD00:DB8:CAFE:5::0001 | FD00:DB8:CAFE:5::0999 | FD00:DB8:CAFE:5::FFFF |
| G10    | FD00:DB8:CAFE:5::1001 | FD00:DB8:CAFE:5::1999 | FD00:DB8:CAFE:5::FFFF |

** LAN6
*** IPv4
De *192.168.20.1* à *192.168.23.254*
| Groupe | Adresse IP   |
| <c>    | <c>          |
|--------+--------------|
| DCRoot | 192.168.20.1 |

*** IPv6 
| <c>    | <c>                   | <c>                   |
| Groupe | Adresse IP            | Passerelle par défaut |
|--------+-----------------------+-----------------------|
| DCRoot | FD00:DB8:CAFE:6::0001 | FD00:DB8:CAFE:6::FFFF |

* Sites
| Numéro | LAN  | Nom  |
|--------+------+------|
| <c>    | <c>  | <c>  |
| 2      | LAN1 | BePa |
| 3      | LAN2 | EsPo |
| 4      | LAN3 | AlAu |
| 5      | LAN4 | FrIt |
| 6      | LAN5 | AnIr |
| 1      | LAN6 | Eu   |
* DCRoot
** Compte Administrator
*** Mot de passe
3Dy7!1@7i&n#0JUg
** ADDS
*** Forêt
EUROPE.LAN
*** NetBIOS
EUROPE
*** Mot de passe
Test123*
*** Réplication
L'Active Directory se réplique toutes les heures mais pas sur tous les LANs.\\
Les LANs *LAN1* et *LAN3* reçoivent la mise à jour toutes les 2 heures, la première heure.\\
Les LANs *LAN2* et *LAN4* reçoivent la mise à jour toutes les 2 heures, la deuxième heure.\\
Quant au LANs *LAN5* et *LAN6*, ils font la réplications toutes les heures.
**** Problème
Ce système de réplication engorge le réseau. Malheureusement, pour l'instant, nous n'avons pas le choix si on veut que tout le monde soit en ordre.
** Adressage IP
*** IP
192.168.20.1
*** Masque
/22 = 255.255.252.0
*** Passerelle
192.168.23.254
** DNS
Les 2 zones doivent être intégrée à l'Active Directory
*** Forward Lookup Zone
| <c>    | <c>          |
| Nom    | IP           |
|--------+--------------|
| dcroot | 192.168.20.1 |

*** Reverse Lookup Zone
| <c>          | <c>    |
| IP           | Nom    |
|--------------+--------|
| 192.168.20.1 | dcroot |

* BackBone
** Routeurs
*** Mots de passe
| <c>       | <c>              |
| Routeurs  | Mot de passe     |
|-----------+------------------|
| Routeur 1 | 5i*70Kklj*Ei19Go |
| Routeur 2 | k21!Z4enDQZY&pN4 |
| Routeur 3 | 1i1%W7F@y#lfo90L |

*** Configurations
**** Routeur 1
**** Routeur 2
**** Routeur 3

* Serveurs
** Convention de nommage
Les noms des serveurs correpondent à SRV-CAPITALE. On doit donc écrire SRV suivit du nom de la capitale du pays en lettre majuscule.

