index.html

<div id="outline-container-sec-3-4-2" class="outline-4">
<h4 id="sec-3-4-2"><span class="section-number-4">3.4.2</span> IPv6</h4>
<div class="outline-text-4" id="text-3-4-2">
<table class="table table-striped table-bordered table-hover table-condensed">


<colgroup>
<col  class="center">

<col  class="center">

<col  class="center">

<col  class="center">
</colgroup>
<thead>
<tr>
<th scope="col" class="text-center">Groupe</th>
<th scope="col" class="text-center">Première adresse</th>
<th scope="col" class="text-center">Dernière adresse</th>
<th scope="col" class="text-center">Passerelle par défaut</th>
</tr>
</thead>
<tbody>
<tr>
<td class="text-center">G7</td>
<td class="text-center">FD00:DB8:CAFE:4::0001</td>
<td class="text-center">FD00:DB8:CAFE:4::0999</td>
<td class="text-center">FD00:DB8:CAFE:4::FFFF</td>
</tr>

<tr>
<td class="text-center">G8</td>
<td class="text-center">FD00:DB8:CAFE:4::1001</td>
<td class="text-center">FD00:DB8:CAFE:4::1999</td>
<td class="text-center">FD00:DB8:CAFE:4::FFFF</td>
</tr>
</tbody>
</table>
</div>
</div>
</div>

<div id="outline-container-sec-3-5" class="outline-3">
<h3 id="sec-3-5"><span class="section-number-3">3.5</span> LAN5</h3>
<div class="outline-text-3" id="text-3-5">
</div><div id="outline-container-sec-3-5-1" class="outline-4">
<h4 id="sec-3-5-1"><span class="section-number-4">3.5.1</span> IPv4</h4>
<div class="outline-text-4" id="text-3-5-1">
<p>
De <b>192.168.16.1</b> à <b>192.168.19.254</b>
</p>
<table class="table table-striped table-bordered table-hover table-condensed">


<colgroup>
<col  class="center">

<col  class="center">
</colgroup>
<thead>
<tr>
<th scope="col" class="text-center">Groupe</th>
<th scope="col" class="text-center">Adresse IP</th>
</tr>
</thead>
<tbody>
<tr>
<td class="text-center">G9</td>
<td class="text-center">192.168.16.1</td>
</tr>

<tr>
<td class="text-center">G10</td>
<td class="text-center">192.168.18.1</td>
</tr>
</tbody>
</table>
</div>
</div>

<div id="outline-container-sec-3-5-2" class="outline-4">
<h4 id="sec-3-5-2"><span class="section-number-4">3.5.2</span> IPv6</h4>
<div class="outline-text-4" id="text-3-5-2">
<table class="table table-striped table-bordered table-hover table-condensed">


<colgroup>
<col  class="center">

<col  class="center">

<col  class="center">

<col  class="center">
</colgroup>
<thead>
<tr>
<th scope="col" class="text-center">Groupe</th>
<th scope="col" class="text-center">Première adresse</th>
<th scope="col" class="text-center">Dernière adresse</th>
<th scope="col" class="text-center">Passerelle par défaut</th>
</tr>
</thead>
<tbody>
<tr>
<td class="text-center">G9</td>
<td class="text-center">FD00:DB8:CAFE:5::0001</td>
<td class="text-center">FD00:DB8:CAFE:5::0999</td>
<td class="text-center">FD00:DB8:CAFE:5::FFFF</td>
</tr>

<tr>
<td class="text-center">G10</td>
<td class="text-center">FD00:DB8:CAFE:5::1001</td>
<td class="text-center">FD00:DB8:CAFE:5::1999</td>
<td class="text-center">FD00:DB8:CAFE:5::FFFF</td>
</tr>
</tbody>
</table>
</div>
</div>
</div>

<div id="outline-container-sec-3-6" class="outline-3">
<h3 id="sec-3-6"><span class="section-number-3">3.6</span> LAN6</h3>
<div class="outline-text-3" id="text-3-6">
</div><div id="outline-container-sec-3-6-1" class="outline-4">
<h4 id="sec-3-6-1"><span class="section-number-4">3.6.1</span> IPv4</h4>
<div class="outline-text-4" id="text-3-6-1">
<p>
De <b>192.168.20.1</b> à <b>192.168.23.254</b>
</p>
<table class="table table-striped table-bordered table-hover table-condensed">


<colgroup>
<col  class="center">

<col  class="center">
</colgroup>
<thead>
<tr>
<th scope="col" class="text-center">Groupe</th>
<th scope="col" class="text-center">Adresse IP</th>
</tr>
</thead>
<tbody>
<tr>
<td class="text-center">DCRoot</td>
<td class="text-center">192.168.20.1</td>
</tr>
</tbody>
</table>
</div>
</div>

<div id="outline-container-sec-3-6-2" class="outline-4">
<h4 id="sec-3-6-2"><span class="section-number-4">3.6.2</span> IPv6</h4>
<div class="outline-text-4" id="text-3-6-2">
<table class="table table-striped table-bordered table-hover table-condensed">


<colgroup>
<col  class="center">

<col  class="center">

<col  class="center">
</colgroup>
<thead>
<tr>
<th scope="col" class="text-center">Groupe</th>
<th scope="col" class="text-center">Adresse IP</th>
<th scope="col" class="text-center">Passerelle par défaut</th>
</tr>
</thead>
<tbody>
<tr>
<td class="text-center">DCRoot</td>
<td class="text-center">FD00:DB8:CAFE:6::0001</td>
<td class="text-center">FD00:DB8:CAFE:6::FFFF</td>
</tr>
</tbody>
</table>
</div>
</div>
</div>
</div>

<div id="outline-container-sec-4" class="outline-2">
<h2 id="sec-4"><span class="section-number-2">4</span> Sites</h2>
<div class="outline-text-2" id="text-4">
<table class="table table-striped table-bordered table-hover table-condensed">


<colgroup>
<col  class="center">

<col  class="center">

<col  class="center">
</colgroup>
<thead>
<tr>
<th scope="col" class="text-center">Numéro</th>
<th scope="col" class="text-center">LAN</th>
<th scope="col" class="text-center">Nom</th>
</tr>
</thead>
<tbody>
<tr>
<td class="text-center">2</td>
<td class="text-center">LAN1</td>
<td class="text-center">BePa</td>
</tr>

<tr>
<td class="text-center">3</td>
<td class="text-center">LAN2</td>
<td class="text-center">EsPo</td>
</tr>

<tr>
<td class="text-center">4</td>
<td class="text-center">LAN3</td>
<td class="text-center">AlAu</td>
</tr>

<tr>
<td class="text-center">5</td>
<td class="text-center">LAN4</td>
<td class="text-center">FrIt</td>
</tr>

<tr>
<td class="text-center">6</td>
<td class="text-center">LAN5</td>
<td class="text-center">AnIr</td>
</tr>

<tr>
<td class="text-center">1</td>
<td class="text-center">LAN6</td>
<td class="text-center">Eu</td>
</tr>
</tbody>
</table>
</div>
</div>
<div id="outline-container-sec-5" class="outline-2">
<h2 id="sec-5"><span class="section-number-2">5</span> DCRoot</h2>
<div class="outline-text-2" id="text-5">
</div><div id="outline-container-sec-5-1" class="outline-3">
<h3 id="sec-5-1"><span class="section-number-3">5.1</span> Compte Administrator</h3>
<div class="outline-text-3" id="text-5-1">
</div><div id="outline-container-sec-5-1-1" class="outline-4">
<h4 id="sec-5-1-1"><span class="section-number-4">5.1.1</span> Mot de passe</h4>
<div class="outline-text-4" id="text-5-1-1">
<p>
3Dy7!1@7i&amp;n#0JUg
</p>
</div>
</div>
</div>
<div id="outline-container-sec-5-2" class="outline-3">
<h3 id="sec-5-2"><span class="section-number-3">5.2</span> ADDS</h3>
<div class="outline-text-3" id="text-5-2">
</div><div id="outline-container-sec-5-2-1" class="outline-4">
<h4 id="sec-5-2-1"><span class="section-number-4">5.2.1</span> Forêt</h4>
<div class="outline-text-4" id="text-5-2-1">
<p>
EUROPE.LAN
</p>
</div>
</div>
<div id="outline-container-sec-5-2-2" class="outline-4">
<h4 id="sec-5-2-2"><span class="section-number-4">5.2.2</span> NetBIOS</h4>
<div class="outline-text-4" id="text-5-2-2">
<p>
EUROPE
</p>
</div>
</div>
<div id="outline-container-sec-5-2-3" class="outline-4">
<h4 id="sec-5-2-3"><span class="section-number-4">5.2.3</span> Mot de passe</h4>
<div class="outline-text-4" id="text-5-2-3">
<p>
Test123*
</p>
</div>
</div>
<div id="outline-container-sec-5-2-4" class="outline-4">
<h4 id="sec-5-2-4"><span class="section-number-4">5.2.4</span> Réplication</h4>
<div class="outline-text-4" id="text-5-2-4">
<p>
L'Active Directory se réplique toutes les heures mais pas sur tous les LANs.
Les LANs <b>LAN1</b> et <b>LAN3</b> reçoivent la mise à jour toutes les 2 heures, la première heure.
Les LANs <b>LAN2</b> et <b>LAN4</b> reçoivent la mise à jour toutes les 2 heures, la deuxième heure.
Quant au LANs <b>LAN5</b> et <b>LAN6</b>, ils font la réplications toutes les heures.
</p>
</div>
<ol class="org-ol"><li><a id="sec-5-2-4-1" name="sec-5-2-4-1"></a>Problème<br ><div class="outline-text-5" id="text-5-2-4-1">
<p>
Ce système de réplication engorge le réseau. Malheureusement, pour l'instant, nous n'avons pas le choix si on veut que tout le monde soit en ordre.
</p>
</div>
</li></ol>
</div>
</div>
<div id="outline-container-sec-5-3" class="outline-3">
<h3 id="sec-5-3"><span class="section-number-3">5.3</span> Adressage IP</h3>
<div class="outline-text-3" id="text-5-3">
</div><div id="outline-container-sec-5-3-1" class="outline-4">
<h4 id="sec-5-3-1"><span class="section-number-4">5.3.1</span> IP</h4>
<div class="outline-text-4" id="text-5-3-1">
<p>
192.168.20.1
</p>
</div>
</div>
<div id="outline-container-sec-5-3-2" class="outline-4">
<h4 id="sec-5-3-2"><span class="section-number-4">5.3.2</span> Masque</h4>
<div class="outline-text-4" id="text-5-3-2">
<p>
/22 = 255.255.252.0
</p>
</div>
</div>
<div id="outline-container-sec-5-3-3" class="outline-4">
<h4 id="sec-5-3-3"><span class="section-number-4">5.3.3</span> Passerelle</h4>
<div class="outline-text-4" id="text-5-3-3">
<p>
192.168.23.254
</p>
</div>
</div>
</div>
<div id="outline-container-sec-5-4" class="outline-3">
<h3 id="sec-5-4"><span class="section-number-3">5.4</span> DNS</h3>
<div class="outline-text-3" id="text-5-4">
<p>
Les 2 zones doivent être intégrée à l'Active Directory
</p>
</div>
<div id="outline-container-sec-5-4-1" class="outline-4">
<h4 id="sec-5-4-1"><span class="section-number-4">5.4.1</span> Forward Lookup Zone</h4>
<div class="outline-text-4" id="text-5-4-1">
<table class="table table-striped table-bordered table-hover table-condensed">


<colgroup>
<col  class="center">

<col  class="center">
</colgroup>
<thead>
<tr>
<th scope="col" class="text-center">Nom</th>
<th scope="col" class="text-center">IP</th>
</tr>
</thead>
<tbody>
<tr>
<td class="text-center">dcroot</td>
<td class="text-center">192.168.20.1</td>
</tr>
</tbody>
</table>
</div>
</div>

<div id="outline-container-sec-5-4-2" class="outline-4">
<h4 id="sec-5-4-2"><span class="section-number-4">5.4.2</span> Reverse Lookup Zone</h4>
<div class="outline-text-4" id="text-5-4-2">
<table class="table table-striped table-bordered table-hover table-condensed">


<colgroup>
<col  class="center">

<col  class="center">
</colgroup>
<thead>
<tr>
<th scope="col" class="text-center">IP</th>
<th scope="col" class="text-center">Nom</th>
</tr>
</thead>
<tbody>
<tr>
<td class="text-center">192.168.20.1</td>
<td class="text-center">dcroot</td>
</tr>
</tbody>
</table>
</div>
</div>
</div>
</div>

<div id="outline-container-sec-6" class="outline-2">
<h2 id="sec-6"><span class="section-number-2">6</span> BackBone</h2>
<div class="outline-text-2" id="text-6">
</div><div id="outline-container-sec-6-1" class="outline-3">
<h3 id="sec-6-1"><span class="section-number-3">6.1</span> Routeurs</h3>
<div class="outline-text-3" id="text-6-1">
</div><div id="outline-container-sec-6-1-1" class="outline-4">
<h4 id="sec-6-1-1"><span class="section-number-4">6.1.1</span> Mots de passe</h4>
<div class="outline-text-4" id="text-6-1-1">
<table class="table table-striped table-bordered table-hover table-condensed">


<colgroup>
<col  class="center">

<col  class="center">
</colgroup>
<thead>
<tr>
<th scope="col" class="text-center">Routeurs</th>
<th scope="col" class="text-center">Mot de passe</th>
</tr>
</thead>
<tbody>
<tr>
<td class="text-center">Routeur 1</td>
<td class="text-center">5i*70Kklj*Ei19Go</td>
</tr>

<tr>
<td class="text-center">Routeur 2</td>
<td class="text-center">k21!Z4enDQZY&amp;pN4</td>
</tr>

<tr>
<td class="text-center">Routeur 3</td>
<td class="text-center">1i1%W7F@y#lfo90L</td>
</tr>
</tbody>
</table>
</div>
</div>

<div id="outline-container-sec-6-1-2" class="outline-4">
<h4 id="sec-6-1-2"><span class="section-number-4">6.1.2</span> Configurations</h4>
<div class="outline-text-4" id="text-6-1-2">
</div><ol class="org-ol"><li><a id="sec-6-1-2-1" name="sec-6-1-2-1"></a>Routeur 1<br ></li>
<li><a id="sec-6-1-2-2" name="sec-6-1-2-2"></a>Routeur 2<br ></li>
<li><a id="sec-6-1-2-3" name="sec-6-1-2-3"></a>Routeur 3<br ></li></ol>
</div>
</div>
</div>

<div id="outline-container-sec-7" class="outline-2">
<h2 id="sec-7"><span class="section-number-2">7</span> Serveurs</h2>
<div class="outline-text-2" id="text-7">
</div><div id="outline-container-sec-7-1" class="outline-3">
<h3 id="sec-7-1"><span class="section-number-3">7.1</span> Convention de nommage</h3>
<div class="outline-text-3" id="text-7-1">
<p>
Les noms des serveurs correpondent à SRV-CAPITALE. On doit donc écrire SRV suivit du nom de la capitale du pays en lettre majuscule.
</p>
</div>
</div>
</div>
