index.org
* DHCP
Pour la distribution des adresses, on doit donner une adresse en rapport avec le pays. Par exemple, si l'utilisateur se trouve en Belgique, son IP fera partie de *192.168.0.3* à *192.168.3.253*

** Manipulation qui permet de donner le bon Range IP
- Créer un scope pour tout le monde
- Créer une "Policy User Class" avec un nom pour le range du groupe du DHCP
- Créer une GPO dans l'AD pour lancer un script à la connexion d'un utilisateur du groupe DHCP :
#+BEGIN_SRC shell
  ipconfig /setclassid nom_de_user_class
  ipconfig /renew
#+END_SRC

** Problème
*** DHCP ne fonctionne pas
Sur notre serveur, on peut configurer le DHCP mais il ne fonctionne pas. La solution : 
1. Se connecter en adminstrateur sur le DCRoot.
2. Aller dans le DHCP Manager
3. Clique droit sur le nom du serveur et faire "Authrorize".

* DNS
Pour éviter de devoir créer sur chaque DNS de chaque LAN les enregistrements de tous les pays, on va créer un redirecteur simple sur les DNS de chaque LAN.
Ainsi, on va tout rediriger vers le DCRoot. La première fois, on va demander l'adresse IP au DCRoot et ensuite, le DNS va le stocker dans son cache.

** Configuration DNS de chaque machine

*** Si la machine est le DNS
| <c>         | <c>                   |
| Type de DNS | Adresse IP            |
|-------------+-----------------------|
| Primaire    | Adresse du DNS du LAN |
| Secondaire  | 127.0.0.1             |

*** Si la machine est le DHCP
| <c>         | <c>                   |
| Type de DNS | Adresse IP            |
|-------------+-----------------------|
| Primaire    | Adresse du DNS du LAN |
| Secondaire  | Adresse du DCRoot     |

* LAN3
** Groupe 5 (DNS)
*** Membres
Florian Di Vrusa et Guillaume Quittet
*** Nom du serveur
SRV-BERLIN
*** Administrateur
| <c>               | <c>              |
| Nom d'utilisateur | Mot de passe     |
|-------------------+------------------|
| Administrator     | T8ha6&X21ANtFu4g |

** Groupe 6 (DHCP)
*** Membres
Killian Kuppens et Julien Mougenot
*** Nom du serveur
SRV-VIENNE
