index.html

<div id="outline-container-sec-8" class="outline-2">
<h2 id="sec-8"><span class="section-number-2">8</span> DHCP</h2>
<div class="outline-text-2" id="text-8">
<p>
Pour la distribution des adresses, on doit donner une adresse en rapport avec le pays. Par exemple, si l'utilisateur se trouve en Belgique, son IP fera partie de <b>192.168.0.3</b> à <b>192.168.3.253</b>
</p>
</div>

<div id="outline-container-sec-8-1" class="outline-3">
<h3 id="sec-8-1"><span class="section-number-3">8.1</span> Manipulation qui permet de donner le bon Range IP</h3>
<div class="outline-text-3" id="text-8-1">
<ul class="org-ul">
<li>Créer un scope pour tout le monde
</li>
<li>Créer une "Policy User Class" avec un nom pour le range du groupe du DHCP
</li>
<li>Créer une GPO dans l'AD pour lancer un script à la connexion d'un utilisateur du groupe DHCP :
</li>
</ul>
<div class="org-src-container">

<pre class="src src-shell">ipconfig /setclassid nom_de_user_class
ipconfig /renew
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-8-2" class="outline-3">
<h3 id="sec-8-2"><span class="section-number-3">8.2</span> Problème</h3>
<div class="outline-text-3" id="text-8-2">
</div><div id="outline-container-sec-8-2-1" class="outline-4">
<h4 id="sec-8-2-1"><span class="section-number-4">8.2.1</span> DHCP ne fonctionne pas</h4>
<div class="outline-text-4" id="text-8-2-1">
<p>
Sur notre serveur, on peut configurer le DHCP mais il ne fonctionne pas. La solution : 
</p>
<ol class="org-ol">
<li>Se connecter en adminstrateur sur le DCRoot.
</li>
<li>Aller dans le DHCP Manager
</li>
<li>Clique droit sur le nom du serveur et faire "Authrorize".
</li>
</ol>
</div>
</div>
</div>
</div>

<div id="outline-container-sec-9" class="outline-2">
<h2 id="sec-9"><span class="section-number-2">9</span> DNS</h2>
<div class="outline-text-2" id="text-9">
<p>
Pour éviter de devoir créer sur chaque DNS de chaque LAN les enregistrements de tous les pays, on va créer un redirecteur simple sur les DNS de chaque LAN.
Ainsi, on va tout rediriger vers le DCRoot. La première fois, on va demander l'adresse IP au DCRoot et ensuite, le DNS va le stocker dans son cache.
</p>
</div>

<div id="outline-container-sec-9-1" class="outline-3">
<h3 id="sec-9-1"><span class="section-number-3">9.1</span> Configuration DNS de chaque machine</h3>
<div class="outline-text-3" id="text-9-1">
</div><div id="outline-container-sec-9-1-1" class="outline-4">
<h4 id="sec-9-1-1"><span class="section-number-4">9.1.1</span> Si la machine est le DNS</h4>
<div class="outline-text-4" id="text-9-1-1">
<table class="table table-striped table-bordered table-hover table-condensed">


<colgroup>
<col  class="center">

<col  class="center">
</colgroup>
<thead>
<tr>
<th scope="col" class="text-center">Type de DNS</th>
<th scope="col" class="text-center">Adresse IP</th>
</tr>
</thead>
<tbody>
<tr>
<td class="text-center">Primaire</td>
<td class="text-center">Adresse du DNS du LAN</td>
</tr>

<tr>
<td class="text-center">Secondaire</td>
<td class="text-center">127.0.0.1</td>
</tr>
</tbody>
</table>
</div>
</div>

<div id="outline-container-sec-9-1-2" class="outline-4">
<h4 id="sec-9-1-2"><span class="section-number-4">9.1.2</span> Si la machine est le DHCP</h4>
<div class="outline-text-4" id="text-9-1-2">
<table class="table table-striped table-bordered table-hover table-condensed">


<colgroup>
<col  class="center">

<col  class="center">
</colgroup>
<thead>
<tr>
<th scope="col" class="text-center">Type de DNS</th>
<th scope="col" class="text-center">Adresse IP</th>
</tr>
</thead>
<tbody>
<tr>
<td class="text-center">Primaire</td>
<td class="text-center">Adresse du DNS du LAN</td>
</tr>

<tr>
<td class="text-center">Secondaire</td>
<td class="text-center">Adresse du DCRoot</td>
</tr>
</tbody>
</table>
</div>
</div>
</div>
</div>

<div id="outline-container-sec-10" class="outline-2">
<h2 id="sec-10"><span class="section-number-2">10</span> LAN3</h2>
<div class="outline-text-2" id="text-10">
</div><div id="outline-container-sec-10-1" class="outline-3">
<h3 id="sec-10-1"><span class="section-number-3">10.1</span> Groupe 5 (DNS)</h3>
<div class="outline-text-3" id="text-10-1">
</div><div id="outline-container-sec-10-1-1" class="outline-4">
<h4 id="sec-10-1-1"><span class="section-number-4">10.1.1</span> Membres</h4>
<div class="outline-text-4" id="text-10-1-1">
<p>
Florian Di Vrusa et Guillaume Quittet
</p>
</div>
</div>
<div id="outline-container-sec-10-1-2" class="outline-4">
<h4 id="sec-10-1-2"><span class="section-number-4">10.1.2</span> Nom du serveur</h4>
<div class="outline-text-4" id="text-10-1-2">
<p>
SRV-BERLIN
</p>
</div>
</div>
<div id="outline-container-sec-10-1-3" class="outline-4">
<h4 id="sec-10-1-3"><span class="section-number-4">10.1.3</span> Administrateur</h4>
<div class="outline-text-4" id="text-10-1-3">
<table class="table table-striped table-bordered table-hover table-condensed">


<colgroup>
<col  class="center">

<col  class="center">
</colgroup>
<thead>
<tr>
<th scope="col" class="text-center">Nom d'utilisateur</th>
<th scope="col" class="text-center">Mot de passe</th>
</tr>
</thead>
<tbody>
<tr>
<td class="text-center">Administrator</td>
<td class="text-center">T8ha6&amp;X21ANtFu4g</td>
</tr>
</tbody>
</table>
</div>
</div>
</div>

<div id="outline-container-sec-10-2" class="outline-3">
<h3 id="sec-10-2"><span class="section-number-3">10.2</span> Groupe 6 (DHCP)</h3>
<div class="outline-text-3" id="text-10-2">
</div><div id="outline-container-sec-10-2-1" class="outline-4">
<h4 id="sec-10-2-1"><span class="section-number-4">10.2.1</span> Membres</h4>
<div class="outline-text-4" id="text-10-2-1">
<p>
Killian Kuppens et Julien Mougenot
</p>
</div>
</div>
<div id="outline-container-sec-10-2-2" class="outline-4">
<h4 id="sec-10-2-2"><span class="section-number-4">10.2.2</span> Nom du serveur</h4>
<div class="outline-text-4" id="text-10-2-2">
<p>
SRV-VIENNE
</p>
</div>
</div>
</div>
</div>
</div><div class="col-md-3"><nav id="table-of-contents">
<div id="text-table-of-contents" class="bs-docs-sidebar">
<ul class="nav">
<li><a href="#sec-1">1. Tâches <code>[2/5]</code></a></li>
<li><a href="#sec-2">2. Groupes</a></li>
<li><a href="#sec-3">3. Adressage IP</a>
<ul class="nav">
<li><a href="#sec-3-1">3.1. LAN1</a></li>
<li><a href="#sec-3-2">3.2. LAN2</a></li>
<li><a href="#sec-3-3">3.3. LAN3</a></li>
<li><a href="#sec-3-4">3.4. LAN4</a></li>
<li><a href="#sec-3-5">3.5. LAN5</a></li>
<li><a href="#sec-3-6">3.6. LAN6</a></li>
</ul>
</li>
<li><a href="#sec-4">4. Sites</a></li>
<li><a href="#sec-5">5. DCRoot</a>
<ul class="nav">
<li><a href="#sec-5-1">5.1. Compte Administrator</a></li>
<li><a href="#sec-5-2">5.2. ADDS</a></li>
<li><a href="#sec-5-3">5.3. Adressage IP</a></li>
<li><a href="#sec-5-4">5.4. DNS</a></li>
</ul>
</li>
<li><a href="#sec-6">6. BackBone</a>
<ul class="nav">
<li><a href="#sec-6-1">6.1. Routeurs</a></li>
</ul>
</li>
<li><a href="#sec-7">7. Serveurs</a>
<ul class="nav">
<li><a href="#sec-7-1">7.1. Convention de nommage</a></li>
</ul>
</li>
<li><a href="#sec-8">8. DHCP</a>
<ul class="nav">
<li><a href="#sec-8-1">8.1. Manipulation qui permet de donner le bon Range IP</a></li>
<li><a href="#sec-8-2">8.2. Problème</a></li>
</ul>
</li>
<li><a href="#sec-9">9. DNS</a>
<ul class="nav">
<li><a href="#sec-9-1">9.1. Configuration DNS de chaque machine</a></li>
</ul>
</li>
<li><a href="#sec-10">10. LAN3</a>
<ul class="nav">
<li><a href="#sec-10-1">10.1. Groupe 5 (DNS)</a></li>
<li><a href="#sec-10-2">10.2. Groupe 6 (DHCP)</a></li>
</ul>
</li>
</ul>
</div>
</nav>
</div></div></div>
<footer id="postamble" class="">
<div><p class="date">Date: Du 23 octobre 2017 au 27 octobre 2017</p>
<p class="author">Auteur: Guillaume Quittet</p>
<p class="creator"><a href="http://www.gnu.org/software/emacs/">Emacs</a> 25.3.1 (<a href="http://orgmode.org">Org-mode</a> 9.1.2)</p>
</div>
</footer>
</body>
</html>
